IDEA Open Model
CrossSectionFactory.FillOHollow Method
Compatible with IDEA StatiCa Beta 20.0
 Fill massive pipe shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public static void FillOHollow(
	CrossSectionParameter cssO,
	double r,
	double t
)
Public Shared Sub FillOHollow (
	cssO As CrossSectionParameter,
	r As Double,
	t As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
r
Type: System.Double
The radius of circle.
t
Type: System.Double
The thickness of wall.
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace